# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, 
# чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть



# from random import randint

# coins = int(input('введите количество монет: '))

# m = 0    
# for _ in range(coins):
#     coin = randint(0, 1)
#     print(coin, end=' ')
#     m += coin
        

# print(f'/nПроще перевернуть все {1 if m < (coins + 1) // 2 else 0}')

# Задача 12: Петя и Катя – брат и сестра. Петя – студент, 
# а Катя – школьница. Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), 
# а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. 
# Помогите Кате отгадать задуманные Петей числа.


# sum_ = int(input("Введите сумму чисел: "))
# p = int(input("Введите произведение числе: "))

# for x in range(1000):
#     for y in range(1, 1000):
#         if x + y == sum_ and x * y == p and x>=y:
#             print(x, y)

# Задача 14: Требуется вывести все целые степени двойки 
# (т.е. числа вида 2k), не превосходящие числа N.

number = int(input("Введите число: "))
num = 1 

while num < number:
    print(num)
    num *= 2
    